// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ссылка = Параметры.Ссылка; 
	ЗаполнитьТабличнуюЧастьЗапасы();
	НайтиНоменклатуруБПНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	ЗаписатьСоответствиеВНоменклатуру();
	ОтправитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедуры

&НаСервере
Процедура НайтиНоменклатуруБПНаСервере()
	
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = СтрокаЗапасы.Номенклатура.Наименование;
		Нашли = МС_ОбщийМодульПоиска.НайтиНоменклатуруПолнотекстово(СтрокаПоиска, 1);
		Если Нашли.Количество() > 0 Тогда
			СтрокаЗапасы.НоменклатураБП = Нашли[0];
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗапасы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура.МС_НоменклатураБП КАК НоменклатураБП
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ТабличнаяЧастьЗапасы.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.НоменклатураБП = ВыборкаДетальныеЗаписи.НоменклатураБП;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	РеквизитФормыВЗначение("Объект").ОтправитьПриходнуюНакладную();	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеВНоменклатуру()
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаЗапасы.Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП Тогда
			Продолжить; 
		КонецЕсли;
		
		Номенклатура = СтрокаЗапасы.Номенклатура.ПолучитьОбъект();	
		Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП;
		Номенклатура.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
