// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ссылка = Параметры.Ссылка; // ДокументСсылка.СчетНаОплатуПоставщика
	ЗаполнитьТабличнуюЧастьЗапасы();
	НайтиНоменклатуруБПНаСервере();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтправитьВБухгалтерию(Команда)
	ЗаписатьСоответствиеВНоменклатуру();
	ОтправитьВБухгалтериюНаСервере();
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОтправитьВБухгалтериюНаСервере()
	РеквизитФормыВЗначение("Объект").ОтправитьСчетНаОплатуПоставщика();	
КонецПроцедуры

&НаСервере
Процедура НайтиНоменклатуруБПНаСервере()
	
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = СтрокаЗапасы.Номенклатура.Наименование;
		Нашли = МС_ОбщийМодульПоиска.НайтиНоменклатуруПолнотекстово(СтрокаПоиска, 1);
		Если Нашли.Количество() > 0 Тогда
			СтрокаЗапасы.НоменклатураБП = Нашли[0]; //СправочникСсылка.МС_НоменклатураБП
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗапасы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПоставщика.Номенклатура КАК Номенклатура,
		|	СчетНаОплатуПоставщика.Номенклатура.МС_НоменклатураБП КАК НоменклатураБП
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика.Запасы КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ТабличнаяЧастьЗапасы.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; // СправочникСсылка.Номенклатура
		НоваяСтрока.НоменклатураБП = ВыборкаДетальныеЗаписи.НоменклатураБП; // СправочникСсылка.МС_НоменклатураБП
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеВНоменклатуру()
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаЗапасы.Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП Тогда
			Продолжить; 
		КонецЕсли;
		
		Номенклатура = СтрокаЗапасы.Номенклатура.ПолучитьОбъект();	
		Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП;
		Номенклатура.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

