// @strict-types


#Область ПрограммныйИнтерфейс

#КонецОбласти


// Возвращает строку представления даты в формате ISO 8601 для использования в JSON.
//
// Параметры:
//   ДатаЗначение - Дата - значение даты для преобразования в строку
//
// Возвращаемое значение:
//   Строка - дата и время в формате yyyy-MM-ddTHH:mm:ss
//   Неопределено - если значение даты не заполнено
//Функция ДатаВСтрокуJSON(Знач ДатаЗначение)
//	
//	Если Не ЗначениеЗаполнено(ДатаЗначение) Тогда
//		Возврат Неопределено; // В JSON будет null
//	КонецЕсли;
//	
//	Возврат Формат(ДатаЗначение, "ДФ=yyyy-MM-dd")
//		+ "T"
//		+ Формат(ДатаЗначение, "ДФ=HH:mm:ss");
//	
//КонецФункции

// Возвращает уникальный идентификатор объекта в строковом представлении.
//
// Параметры:
//   СсылкаНаОбъект - ЛюбаяСсылка
//
// Возвращаемое значение:
//   Строка - уникальный идентификатор объекта
//   - Строка - пустая строка, если параметр не заполнен
//Функция ГУИД(СсылкаНаОбъект) Экспорт
//	
//	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	Возврат СокрЛП(Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
//	
//КонецФункции

//Функция БезопаснаяСтрока(Значение)
//	
//	Если Значение = Неопределено Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(Значение) Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	Возврат XMLСтрока(Значение);
//	
//КонецФункции
//
//#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Преобразует данные в строку формата JSON.
//
// Параметры:
//   Данные - Структура - данные для сериализации
//
// Возвращаемое значение:
//   Строка - данные в формате JSON
Функция ЗаписатьДанныеВJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

// Возвращает десериализованные данные из строки в формате JSON.
//
// Параметры:
//   СтрокаJSON - Строка - строка в формате JSON
//
// Возвращаемое значение:
//   Структура, Произвольный - десериализованные данные (Тип, Массив, Структура и др.)
Функция ПрочитатьJSONИзСтроки(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Данные = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
