// @strict-types

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресБП = Константы.МС_АдресБП.Получить();
	ПортБП = Константы.МС_ПортБП.Получить();
	ПутьHTTPСервисаБП = Константы.МС_ПутьHTTPСервисаБП.Получить();
	ПользовательБП = Константы.МС_ПользовательБП.Получить();
	ПарольБП = Константы.МС_ПарольБП.Получить();
	ТаймаутHTTPБП = Константы.МС_ТаймаутHTTPБП.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
	НовоеСообщение = Новый СообщениеПользователю;
	НовоеСообщение.Текст = "Настройки обмена сохранены.";
	НовоеСообщение.Сообщить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	Константы.МС_АдресБП.Установить(АдресБП);
	Константы.МС_ПортБП.Установить(ПортБП);
	Константы.МС_ПутьHTTPСервисаБП.Установить(ПутьHTTPСервисаБП);
	Константы.МС_ПользовательБП.Установить(ПользовательБП);
	Константы.МС_ПарольБП.Установить(ПарольБП);
	Константы.МС_ТаймаутHTTPБП.Установить(ТаймаутHTTPБП);
КонецПроцедуры

#КонецОбласти